{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_w", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_b", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "cudnn_off": "0", 
        "cudnn_tune": "None", 
        "dilate": "()", 
        "kernel": "(5,5)", 
        "layout": "None", 
        "no_bias": "0", 
        "num_filter": "20", 
        "num_group": "1", 
        "pad": "()", 
        "stride": "()", 
        "workspace": "1024"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "tanh1", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attrs": {
        "count_include_pad": "None", 
        "cudnn_off": "0", 
        "global_pool": "0", 
        "kernel": "(2,2)", 
        "layout": "None", 
        "p_value": "None", 
        "pad": "()", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_w", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_b", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attrs": {
        "cudnn_off": "0", 
        "cudnn_tune": "None", 
        "dilate": "()", 
        "kernel": "(5,5)", 
        "layout": "None", 
        "no_bias": "0", 
        "num_filter": "50", 
        "num_group": "1", 
        "pad": "()", 
        "stride": "()", 
        "workspace": "1024"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "tanh2", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attrs": {
        "count_include_pad": "None", 
        "cudnn_off": "0", 
        "global_pool": "0", 
        "kernel": "(2,2)", 
        "layout": "None", 
        "p_value": "None", 
        "pad": "()", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_w", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_b", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3", 
      "attrs": {
        "cudnn_off": "0", 
        "cudnn_tune": "None", 
        "dilate": "()", 
        "kernel": "(2,2)", 
        "layout": "None", 
        "no_bias": "0", 
        "num_filter": "500", 
        "num_group": "1", 
        "pad": "()", 
        "stride": "()", 
        "workspace": "1024"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "tanh3", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3", 
      "attrs": {
        "count_include_pad": "None", 
        "cudnn_off": "0", 
        "global_pool": "0", 
        "kernel": "(2,2)", 
        "layout": "None", 
        "p_value": "None", 
        "pad": "()", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(1,1)"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_w", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_b", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attrs": {
        "flatten": "1", 
        "no_bias": "0", 
        "num_hidden": "500"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "tanh4", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc2_w", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_b", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc2", 
      "attrs": {
        "flatten": "1", 
        "no_bias": "0", 
        "num_hidden": "10"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "attrs": {
        "grad_scale": "1", 
        "ignore_label": "-1", 
        "multi_output": "0", 
        "normalization": "null", 
        "out_grad": "0", 
        "preserve_shape": "0", 
        "smooth_alpha": "0", 
        "use_ignore": "0"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    6, 
    7, 
    11, 
    12, 
    17, 
    18, 
    21, 
    22, 
    24
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    7, 
    8, 
    9, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    17, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29
  ], 
  "heads": [[25, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}